package com.green.day11.Ch15;

public class ObjectRelation {
    /*
    객체간의 관계
    -is A:상속 처리
    -has A:멤버필드 처리

    예를들어 모바일폰과 스마트폰의 관계였을때 "모바일폰은 스마트폰이다."가 어색하지 않으면 is-A관계
    바바리안은 캐릭터이다>> is-A관계 반대로 하면 어색해짐
   ------
    예를들어 스피커 자동차의 관계"자동차는 스피커이다"
    자동차에는 스피커가 있다. 포함된다.>>포함의 의미 has-A 관계
    자동차는 스피커를 가지고있다

    바바리안, 도끼를 사용할수 있다. 바바리안은 도끼이다 어색하다
    "바바리안은 도끼를 무기로 사용한다."
    ------

   is-A,has-A로 처리할지는 온전히 개발자한테 달려있다, 관리가 유리한대로 하면 된다.
   보통 말로 들었을때 어색하지 않은 문장이 관계ㅡ를 설정하지만 다는 아니다


     */
    public static void main(String[] args) {

    }
}
